-- Задание 1. Самый дорогой товар
SELECT название, цена FROM Товар ORDER BY цена DESC LIMIT 1;

-- Задание 2. Самый дешёвый товар
SELECT название, цена FROM Товар ORDER BY цена ASC LIMIT 1;

-- Задание 3. Товары одной категории (жанра)
SELECT название, цена FROM Товар WHERE жанр = 'Стратегия';

-- Задание 4. Поиск по названию (содержит букву "о")
SELECT название FROM Товар WHERE название LIKE '%о%';

-- Задание 5. Все заказы
SELECT id, дата, клиент, товар_id, количество FROM Заказ;

-- Задание 6. Заказы конкретного клиента
SELECT * FROM Заказ WHERE клиент = 'Иванов Иван Иванович';

-- Задание 7. JOIN — заказы с названиями товаров
SELECT Заказ.дата, Заказ.клиент, Товар.название, Заказ.количество
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 8. Общая сумма всех заказов
SELECT SUM(Товар.цена * Заказ.количество)
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 9. Количество заказов по клиентам
SELECT клиент, COUNT(*) AS всего_заказов 
FROM Заказ 
GROUP BY клиент;

-- Задание 10. Свой запрос
-- Что хочу получить: Список товаров, которых на складе меньше 20 штук для дозакупки
SELECT название, количество FROM Товар WHERE количество < 20 ORDER BY количество ASC;
